src/geekbang-tech-and-business-cases.org
#+title: 极客时间|技术与商业案例解读 文章目录
#+options: num:nil


** [[https://time.geekbang.org/column/article/49][开篇词 | 突破技术思维，站在商业的角度看问题]]

从今天开始，我要和你聊聊过去30年那些有意思的互联网公司，它们起落沉浮，或风头正劲，但都有一个共通点，就是...


** [[https://time.geekbang.org/column/article/34][001 | 西雅图IT公司之RealNetworks：一个帝国的兴衰（上）]]

今天的主角，是一个曾经兴起，最终又倒下的帝国。在西雅图派克市场周围一个不起眼的楼宇里面，有一家叫作RealNe...


** [[https://time.geekbang.org/column/article/39][002 | 西雅图IT公司之RealNetworks：一个帝国的兴衰（下）]]

上回讲到微软进军RealNetworks的市场，RealNetworks面对这场战争，又是如何应对的呢？


** [[https://time.geekbang.org/column/article/314][003 | 以RealNetworks为例，谈谈初创公司如何应对巨头碾压]]

微软利用一贯的“免费加捆绑”策略杀入媒体领域，苹果也带着QuickTime进入竞争行列，RealNetworks公司又将...


** [[https://time.geekbang.org/column/article/321][004 | 文档数据库的缔造者MongoDB（上）]]

MongoDB的诞生像一场意外。这个文档型数据库以易用性知名并不断发展，今天就来揭秘其团队的开发重心、商业运作...


** [[https://time.geekbang.org/column/article/326][005 | 文档数据库的缔造者MongoDB（下）]]

MongoDB重视用户体验超过核心功能的传统，让其陷入巨大的安全危机，而从具有CIA背景的风投公司拿钱，又让人多...


** [[https://time.geekbang.org/column/article/333][006 | 以MongoDB为例，看基础架构类产品创业]]

作为一款基础架构产品，MongoDB以易用性著称，但不够注重系统的可靠性，致使用户频频转向其他产品。那么，基...


** [[https://time.geekbang.org/column/article/401][007 | 直面MongoDB，谈微软的NoSQL战略]]

2013年，MongoDB占据美好而巨大的数据库市场，成为很多初创企业的首选。微软究竟做了哪些举措，让Cosmos DB成...


** [[https://time.geekbang.org/column/article/412][008 | 免费还是收费？WinRAR的生意经]]

压缩软件WinRAR的普遍使用与广泛传播，可谓代表了一个时代，并一度成为压缩软件里事实上的标配。其发行公司在...


** [[https://time.geekbang.org/column/article/415][009 | 可视化分析鼻祖Tableau]]

Tableau作为可视化分析软件领域的奠基人，算是学术界人士创业成功的典范，今天就来看一看其成长的历程。


** [[https://time.geekbang.org/column/article/473][010 | 从Tableau上市，看学术界和工业界人士创业]]

Tableau和RealNetworks的创业和发展史，恰好可以代表现实中的两类创业者。今天，我就来分析下学术界和工业界人...


** [[https://time.geekbang.org/column/article/475][011 | 周鸿祎和BAT的沉浮录（上）]]

周鸿祎，作为中国互联网发展史上非常重要又很有特色的人，曾在不同时期与BAT进行了战斗，却依旧风生水起。他出...


