html/geekbang-tech-and-business-cases.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>极客时间|技术与商业案例解读 文章目录</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">极客时间|技术与商业案例解读 文章目录</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc956a78">开篇词 | 突破技术思维，站在商业的角度看问题</a></li>
<li><a href="#orgbd2fded">001 | 西雅图IT公司之RealNetworks：一个帝国的兴衰（上）</a></li>
<li><a href="#org52b2e9c">002 | 西雅图IT公司之RealNetworks：一个帝国的兴衰（下）</a></li>
<li><a href="#orga267ae7">003 | 以RealNetworks为例，谈谈初创公司如何应对巨头碾压</a></li>
<li><a href="#org44ffd56">004 | 文档数据库的缔造者MongoDB（上）</a></li>
<li><a href="#orgf01be66">005 | 文档数据库的缔造者MongoDB（下）</a></li>
<li><a href="#orgffbe747">006 | 以MongoDB为例，看基础架构类产品创业</a></li>
<li><a href="#org49dc341">007 | 直面MongoDB，谈微软的NoSQL战略</a></li>
<li><a href="#org6aea4a9">008 | 免费还是收费？WinRAR的生意经</a></li>
<li><a href="#orga77359b">009 | 可视化分析鼻祖Tableau</a></li>
<li><a href="#org2dd0c7b">010 | 从Tableau上市，看学术界和工业界人士创业</a></li>
<li><a href="#orgfe01e70">011 | 周鸿祎和BAT的沉浮录（上）</a></li>
<li><a href="#orgdca1571">012 | 周鸿祎和BAT的沉浮录（中）</a></li>
<li><a href="#org27a3529">013 | 周鸿祎和BAT的沉浮录（下）</a></li>
<li><a href="#orgcacd2ad">014 | 周鸿祎和BAT的沉浮录（后记）</a></li>
<li><a href="#orgd032343">015 | 在线旅游帝国Expedia崛起的背后</a></li>
<li><a href="#orgf1a9a0d">016 | 亚马逊领导力准则之要有硬骨头</a></li>
<li><a href="#org3c09f85">017 | Hadoop三国之魏国Cloudera</a></li>
<li><a href="#org049eedc">018 | Hadoop三国之吴国MapR</a></li>
<li><a href="#org8c51070">019 | Hadoop三国之蜀国Hortonworks</a></li>
<li><a href="#org9f3f36f">020 | Hadoop及其发行商的未来</a></li>
<li><a href="#orgf93e2d8">021 | 彼得 · 蒂尔的投资人生</a></li>
<li><a href="#org5629371">022 | 商业之外的彼得 · 蒂尔</a></li>
<li><a href="#orgc375dcc">023 | 创业的智慧：从彼得·蒂尔的创投哲学说起</a></li>
<li><a href="#org119cc16">024 | 房产经纪的颠覆者Redfin：在“传统”与“现代”间徘徊</a></li>
<li><a href="#org709f3e1">025 | 房产经纪的“协作者”Zillow：一个地产数据平台</a></li>
<li><a href="#org2698435">026 | 颠覆还是协作，房地产市场上Redfin和Zillow的抉择</a></li>
<li><a href="#org1fa9b1f">027 | 应用交付网络大厂F5：“一招鲜”之殇</a></li>
<li><a href="#org8533d23">028 | 在线差旅报销鼻祖Concur：在转型中获得发展</a></li>
<li><a href="#orged8e12e">029 | 漫谈企业转型：在市场变迁中寻找生机</a></li>
<li><a href="#org416d2c1">030 | 克雷公司沉浮录：行走在超级计算机市场</a></li>
<li><a href="#org48fe847">031 | “单一化”的隐忧：从克雷公司看“一条腿走路”</a></li>
<li><a href="#org6e178c6">032 | 亚马逊领导力准则之决策正确</a></li>
<li><a href="#org11cd01d">033 | Halo的开发者Bungie：与微软的聚散</a></li>
<li><a href="#orgde40d62">034 | “卖身”须谨慎：创业公司面临的抉择</a></li>
<li><a href="#orgfc80630">035 | 亚马逊领导力准则之客户至尚</a></li>
<li><a href="#orgfabef7e">036 | 智能音箱的战斗：亚马逊的硬件路</a></li>
<li><a href="#org9fd5bd6">037 | 智能音箱的战斗：Echo攻城略地</a></li>
<li><a href="#org8c698c0">038 | 智能音箱的战斗：语音助手Alexa</a></li>
<li><a href="#org117efb1">039 | 智能音箱的战斗：谷歌的杀入</a></li>
<li><a href="#orgcf45de8">040 | 智能音箱的战斗：亚马逊的战略布局</a></li>
<li><a href="#orgcaa2414">041 | 智能音箱的战斗：巨头纷纷入场</a></li>
<li><a href="#orgc441902">042 | 智能音箱的战斗：白马非马</a></li>
<li><a href="#org45b3fe2">043 | 如何透过一个领域去联合分析多家企业？</a></li>
<li><a href="#org11921fc">044 | 谷歌的创新精神：好的、坏的和丑陋的（上）</a></li>
<li><a href="#org93f67ea">045 | 谷歌的创新精神：好的、坏的和丑陋的（下）</a></li>
<li><a href="#org5a9ce4a">046 | 仁科：被迫再创业的David Duffield</a></li>
<li><a href="#orgc1d1440">047 | 仁科：飞跃发展的企业级软件帝国</a></li>
<li><a href="#org4d96ca1">048 | 仁科：收购和被收购</a></li>
<li><a href="#org8a00b82">049 | 仁科的成与败</a></li>
<li><a href="#org3fd847f">050 | 亚马逊领导力准则之勤俭节约</a></li>
<li><a href="#org2b7c88c">051 | WorkDay：杜菲尔德复仇记</a></li>
<li><a href="#org8a137b6">052 | David Duffield的眼界和成败</a></li>
<li><a href="#org70bbdcc">053 | 分析企业的两要素：远见和执行力</a></li>
<li><a href="#org57b75c6">054 | 互联网第一股雅虎的兴衰：霸主的诞生</a></li>
<li><a href="#org754984a">055 | 互联网第一股雅虎的兴衰：运气不敌技术</a></li>
<li><a href="#org0ea2d4e">056 | 互联网第一股雅虎的兴衰：没有救世主</a></li>
<li><a href="#orge2971e4">057 | 成也杨致远，败也杨致远</a></li>
<li><a href="#org7f3edfb">058 | 企业因人成事，领导人很重要</a></li>
<li><a href="#org3f73c25">059 | 亚马逊领导力准则之主人翁精神</a></li>
<li><a href="#orgc0cefb2">060 | 半条命的Dota帝国Valve：半条命</a></li>
<li><a href="#org5b17ee3">061 | 半条命的Dota帝国Valve：Steam平台</a></li>
<li><a href="#org39859a7">062 | 半条命的Dota帝国Valve：Dota 2</a></li>
<li><a href="#orgd87c917">063 | 半条命的Dota帝国Valve：无领导管理</a></li>
<li><a href="#orgfcb237a">064 | 半条命的Dota帝国Valve：虚拟现实</a></li>
<li><a href="#org33324c4">065 | Gabe Newell：Valve帝国制度的利弊</a></li>
<li><a href="#org484ca01">066 | 管中窥豹之从面试看企业文化：微软</a></li>
<li><a href="#org722c803">067 | 管中窥豹之从面试看企业文化：亚马逊</a></li>
<li><a href="#org5428730">068 | 管中窥豹之从面试看企业文化：谷歌</a></li>
<li><a href="#orga043d77">069 | 管中窥豹之从面试看企业文化：甲骨文</a></li>
<li><a href="#orga1c6b17">070 | 管中窥豹之从面试看企业文化：Facebook</a></li>
<li><a href="#org88ff237">071 | 透过企业用人之道看企业发展</a></li>
<li><a href="#org81cd383">072 | Zenefits：一个卖保险的创业公司</a></li>
<li><a href="#org6840c88">073 | Glassdoor：让公司信息对个人透明</a></li>
<li><a href="#org3845e43">074 | 从巴顿的创业史看巴顿</a></li>
<li><a href="#org5835d7c">075 | 办公软件的战斗：开篇</a></li>
<li><a href="#org754ed18">076 | VisiCalc：第一个电子表格软件的诞生</a></li>
<li><a href="#org405edae">077 | 亚马逊领导力准则之选贤育能</a></li>
<li><a href="#org42406f8">078 | WordStar：第一个字处理软件的故事</a></li>
<li><a href="#org87d2170">079 | 微软：办公软件战场的螳螂</a></li>
<li><a href="#org16ad54e">080 | 亚马逊领导力准则之最高标准</a></li>
<li><a href="#orgfd4cb73">081 | WordPerfect：字处理软件的新秀</a></li>
<li><a href="#org08ef3a3">082 | Lotus 1-2-3：莲花公司的电子表格帝国</a></li>
<li><a href="#org1430c63">083 | 亚马逊领导力准则之创新简化</a></li>
<li><a href="#org7186452">084 | 红狮会战：微软的反击</a></li>
<li><a href="#org42f8944">085 | 大杀器Lotus Notes 和被收购的莲花公司</a></li>
<li><a href="#org88ceec4">086 | 亚马逊领导力准则之崇尚行动</a></li>
<li><a href="#org3571502">087 | 无敌寂寞的微软之为创新而创新</a></li>
<li><a href="#orgb1a03f2">088 | 办公软件的新时代：微软和谷歌的战斗</a></li>
<li><a href="#org47aa794">089 | 亚马逊领导力准则之远见卓识</a></li>
<li><a href="#org5167e37">090 | 异军突起的Slack</a></li>
<li><a href="#orgc390caf">091 | 办公软件战斗的启示：内忧总是强于外患</a></li>
<li><a href="#orgc024bba">092 | 亚马逊领导力准则之好奇求知与赢得信任</a></li>
<li><a href="#org525396f">093 | 办公软件战斗的启示：敌人的出现常常出其不意</a></li>
<li><a href="#orgf9a28da">094 | 亚马逊领导力准则之刨根问底与达成业绩</a></li>
<li><a href="#org6f1550f">095 | 谷歌的大数据路：从“三驾马车”到一无所有</a></li>
<li><a href="#org04aeb1f">096 | 谷歌的大数据路：一场影响深远的论战</a></li>
<li><a href="#org7c04b76">097 | 谷歌的大数据路：谷歌的“黑科技”</a></li>
<li><a href="#orgc3c096a">098 | 如何读懂类似谷歌“三驾马车”这样的技术论文？</a></li>
<li><a href="#org415536d">099 | 雅虎：大数据领域的“活雷锋”</a></li>
<li><a href="#org44a0c1a">100 | IBM的大数据路之起早贪黑赶了晚集</a></li>
<li><a href="#orgc4f0ec1">101 | 社交公司们的大数据贡献</a></li>
<li><a href="#orgc5b7780">102 | 微软的大数据发展史：微软硅谷研究院</a></li>
<li><a href="#org5451071">103 | 微软的大数据发展史：必应的Cosmos</a></li>
<li><a href="#orgf3d0c54">104 | 微软的大数据发展史：Azure的大数据发展</a></li>
<li><a href="#orgee9cee4">105 | 亚马逊的大数据故事：从先驱者到插管吸血开源</a></li>
<li><a href="#org2b3083f">106 | 亚马逊的大数据故事：创新和拿来并存的云服务</a></li>
<li><a href="#orgd979f93">107 | 阿里巴巴的大数据故事：数据分析平台发展史</a></li>
<li><a href="#org9dca148">108 | 阿里巴巴的大数据故事：流计算引擎发展史</a></li>
<li><a href="#orga5d98a3">109 | 大公司的大数据战略得失：自建轮子成本高</a></li>
<li><a href="#orgf9e463e">110 | 大公司的大数据战略得失：抱团取暖难敌插管吸血者</a></li>
<li><a href="#orgf3bddb2">111 | Palantir：神秘的大数据独角兽</a></li>
<li><a href="#org1c5fb48">112 | Splunk：机器大数据的分析帝国</a></li>
<li><a href="#orgfb8ea9b">113 | Confluent：在Kafka上飞驰的数据交换者</a></li>
<li><a href="#org5abd565">114 | Powerset：HBase的老东家</a></li>
<li><a href="#org6be8fe9">115 | Cassandra和DataStax的故事</a></li>
<li><a href="#orgb435298">116 | Databricks之Spark的数据金砖王国</a></li>
<li><a href="#orgfa10d8c">117 | Data Artisans：浴火重生的新一代大数据计算引擎Flink</a></li>
<li><a href="#org07696dd">118 | Dremio:在Drill和Arrow上的大数据公司</a></li>
<li><a href="#org7bd080d">119 | Imply：基于Druid的大数据分析公司</a></li>
<li><a href="#orga25945f">120 | Kyligence：阿帕奇麒麟背后的大数据公司</a></li>
<li><a href="#org6f3f8f2">121 | Snowflake:云端的弹性数据仓库</a></li>
<li><a href="#orga1cb15a">122 | TiDB：一个国产新数据库的创业故事</a></li>
<li><a href="#org9c9c258">123 | 大数据创业公司的前景：红海创业多艰辛</a></li>
<li><a href="#org7fcc8bb">124 | 如何通过企业技术积累去分析一家企业？</a></li>
<li><a href="#orgf0fdaf0">125 | Facebook的黑客精神</a></li>
<li><a href="#org1bf1e8a">126 | Twitter：蓝色小鸟还能飞多久（上）</a></li>
<li><a href="#org8b58659">127 | Twitter：蓝色小鸟还能飞多久（下）</a></li>
<li><a href="#org43e15ef">128 | 赚钱是根本，换CEO也没救</a></li>
<li><a href="#org20da912">129 | Square：手机POS机和比特币交易</a></li>
<li><a href="#org2bdf855">130 | 创意很重要，但不是一切</a></li>
<li><a href="#orgb2f80fc">131 | 杰克·多西：分身有术之兼任两家上市公司CEO</a></li>
<li><a href="#orgbe09f80">132 | Groupon：团购鼻祖的兴衰</a></li>
<li><a href="#org5f6d065">133 | 卖掉自己是不是更好</a></li>
<li><a href="#org7128b64">134 | 企业在线存储Box</a></li>
<li><a href="#org190bb63">135 | 个人在线存储 Dropbox</a></li>
<li><a href="#orgb678f66">136 | 做产品先做消费者市场，还是先做企业市场</a></li>
<li><a href="#org4baaee6">137 | 今天我们都来Pin图片之Pinterest的图片社交路</a></li>
<li><a href="#org04059fa">138 | 企业不上市为哪般</a></li>
<li><a href="#orgc31c475">139 | 微软的综合工程师改革</a></li>
<li><a href="#orgfaee257">140 | SaaS先驱Salesforce</a></li>
<li><a href="#org56295bf">141 | 太超前好不好</a></li>
<li><a href="#org315ac9c">142 | Sun：太阳的升起</a></li>
<li><a href="#org54a2e23">143 | Sun：太阳的陨落</a></li>
<li><a href="#orgc075856">144 | 看错敌人多可怕</a></li>
<li><a href="#org6b9ae54">145 | SAP的HANA战略（上）</a></li>
<li><a href="#org5425be4">146 | SAP的HANA战略（下）</a></li>
<li><a href="#org2e7ee34">147 | 成功的忽悠加成功的执行等于成功的产品</a></li>
<li><a href="#orgc0ed8c1">148 | SQL Server发展史</a></li>
<li><a href="#org2a87d51">149 | 眼光决定一切</a></li>
<li><a href="#orgf6b47aa">150 | Ashton-Tate：桌面数据库王者的兴衰</a></li>
<li><a href="#org4d8c0b1">151 | 无敌不可以肆意妄为</a></li>
<li><a href="#org829fe4d">152 | Reddit：天涯论坛美国版</a></li>
<li><a href="#orgda6edea">153 | Hacker News：创业社交两不误</a></li>
<li><a href="#orgea25f5b">154 | Y Combinator：孵化器还是培训班？</a></li>
<li><a href="#org3a70a2a">155 | 创业公司进孵化器真的值得吗？</a></li>
<li><a href="#orga031f31">156 | Paul Graham：硅谷创业教父</a></li>
<li><a href="#orga7d9a48">157 | Zynga：发家从农场开始</a></li>
<li><a href="#orgdcca70b">158 | 论Zynga的倒台</a></li>
<li><a href="#orgc166fe2">159 | 企业分析要求综合素质</a></li>
<li><a href="#orge2465bc">结束语 | 积跬步，而终至千里</a></li>
<li><a href="#org62285ec">一键直达 | 系列解读文章回顾</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgc956a78" class="outline-2">
<h2 id="orgc956a78"><a href="https://time.geekbang.org/column/article/49">开篇词 | 突破技术思维，站在商业的角度看问题</a></h2>
<div class="outline-text-2" id="text-orgc956a78">
<p>
从今天开始，我要和你聊聊过去30年那些有意思的互联网公司，它们起落沉浮，或风头正劲，但都有一个共通点，就是&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgbd2fded" class="outline-2">
<h2 id="orgbd2fded"><a href="https://time.geekbang.org/column/article/34">001 | 西雅图IT公司之RealNetworks：一个帝国的兴衰（上）</a></h2>
<div class="outline-text-2" id="text-orgbd2fded">
<p>
今天的主角，是一个曾经兴起，最终又倒下的帝国。在西雅图派克市场周围一个不起眼的楼宇里面，有一家叫作RealNe&#x2026;
</p>
</div>
</div>


<div id="outline-container-org52b2e9c" class="outline-2">
<h2 id="org52b2e9c"><a href="https://time.geekbang.org/column/article/39">002 | 西雅图IT公司之RealNetworks：一个帝国的兴衰（下）</a></h2>
<div class="outline-text-2" id="text-org52b2e9c">
<p>
上回讲到微软进军RealNetworks的市场，RealNetworks面对这场战争，又是如何应对的呢？
</p>
</div>
</div>


<div id="outline-container-orga267ae7" class="outline-2">
<h2 id="orga267ae7"><a href="https://time.geekbang.org/column/article/314">003 | 以RealNetworks为例，谈谈初创公司如何应对巨头碾压</a></h2>
<div class="outline-text-2" id="text-orga267ae7">
<p>
微软利用一贯的“免费加捆绑”策略杀入媒体领域，苹果也带着QuickTime进入竞争行列，RealNetworks公司又将&#x2026;
</p>
</div>
</div>


<div id="outline-container-org44ffd56" class="outline-2">
<h2 id="org44ffd56"><a href="https://time.geekbang.org/column/article/321">004 | 文档数据库的缔造者MongoDB（上）</a></h2>
<div class="outline-text-2" id="text-org44ffd56">
<p>
MongoDB的诞生像一场意外。这个文档型数据库以易用性知名并不断发展，今天就来揭秘其团队的开发重心、商业运作&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgf01be66" class="outline-2">
<h2 id="orgf01be66"><a href="https://time.geekbang.org/column/article/326">005 | 文档数据库的缔造者MongoDB（下）</a></h2>
<div class="outline-text-2" id="text-orgf01be66">
<p>
MongoDB重视用户体验超过核心功能的传统，让其陷入巨大的安全危机，而从具有CIA背景的风投公司拿钱，又让人多&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgffbe747" class="outline-2">
<h2 id="orgffbe747"><a href="https://time.geekbang.org/column/article/333">006 | 以MongoDB为例，看基础架构类产品创业</a></h2>
<div class="outline-text-2" id="text-orgffbe747">
<p>
作为一款基础架构产品，MongoDB以易用性著称，但不够注重系统的可靠性，致使用户频频转向其他产品。那么，基&#x2026;
</p>
</div>
</div>


<div id="outline-container-org49dc341" class="outline-2">
<h2 id="org49dc341"><a href="https://time.geekbang.org/column/article/401">007 | 直面MongoDB，谈微软的NoSQL战略</a></h2>
<div class="outline-text-2" id="text-org49dc341">
<p>
2013年，MongoDB占据美好而巨大的数据库市场，成为很多初创企业的首选。微软究竟做了哪些举措，让Cosmos DB成&#x2026;
</p>
</div>
</div>


<div id="outline-container-org6aea4a9" class="outline-2">
<h2 id="org6aea4a9"><a href="https://time.geekbang.org/column/article/412">008 | 免费还是收费？WinRAR的生意经</a></h2>
<div class="outline-text-2" id="text-org6aea4a9">
<p>
压缩软件WinRAR的普遍使用与广泛传播，可谓代表了一个时代，并一度成为压缩软件里事实上的标配。其发行公司在&#x2026;
</p>
</div>
</div>


<div id="outline-container-orga77359b" class="outline-2">
<h2 id="orga77359b"><a href="https://time.geekbang.org/column/article/415">009 | 可视化分析鼻祖Tableau</a></h2>
<div class="outline-text-2" id="text-orga77359b">
<p>
Tableau作为可视化分析软件领域的奠基人，算是学术界人士创业成功的典范，今天就来看一看其成长的历程。
</p>
</div>
</div>


<div id="outline-container-org2dd0c7b" class="outline-2">
<h2 id="org2dd0c7b"><a href="https://time.geekbang.org/column/article/473">010 | 从Tableau上市，看学术界和工业界人士创业</a></h2>
<div class="outline-text-2" id="text-org2dd0c7b">
<p>
Tableau和RealNetworks的创业和发展史，恰好可以代表现实中的两类创业者。今天，我就来分析下学术界和工业界人&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgfe01e70" class="outline-2">
<h2 id="orgfe01e70"><a href="https://time.geekbang.org/column/article/475">011 | 周鸿祎和BAT的沉浮录（上）</a></h2>
<div class="outline-text-2" id="text-orgfe01e70">
<p>
周鸿祎，作为中国互联网发展史上非常重要又很有特色的人，曾在不同时期与BAT进行了战斗，却依旧风生水起。他出&#x2026;
</p>
</div>
</div>
