html/geekbang-tech-and-business-cases.html


<div id="outline-container-orgdca1571" class="outline-2">
<h2 id="orgdca1571"><a href="https://time.geekbang.org/column/article/544">012 | 周鸿祎和BAT的沉浮录（中）</a></h2>
<div class="outline-text-2" id="text-orgdca1571">
<p>
与百度的战斗告一段落，3721迎来了雅虎的收购。而阿里巴巴随后入局雅虎，让另一场战斗悄然而至。今天，我就带你&#x2026;
</p>
</div>
</div>


<div id="outline-container-org27a3529" class="outline-2">
<h2 id="org27a3529"><a href="https://time.geekbang.org/column/article/546">013 | 周鸿祎和BAT的沉浮录（下）</a></h2>
<div class="outline-text-2" id="text-org27a3529">
<p>
和阿里的战斗告一段落，奇虎360又和腾讯共视战场，这就是中国互联网发展史上里程碑式的“3Q大战”。此事对中国&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgcacd2ad" class="outline-2">
<h2 id="orgcacd2ad"><a href="https://time.geekbang.org/column/article/556">014 | 周鸿祎和BAT的沉浮录（后记）</a></h2>
<div class="outline-text-2" id="text-orgcacd2ad">
<p>
中国互联网的发展史上，周鸿祎不可不提，他有着非常鲜明的个人特点，又有着非同寻常的经历。他与百度、阿里、腾&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgd032343" class="outline-2">
<h2 id="orgd032343"><a href="https://time.geekbang.org/column/article/557">015 | 在线旅游帝国Expedia崛起的背后</a></h2>
<div class="outline-text-2" id="text-orgd032343">
<p>
Expedia原是巴顿自微软内部发起的项目，拆分上市后被IAC买下。而作为绝对的企业经营和资本运作高手，IAC董事长&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgf1a9a0d" class="outline-2">
<h2 id="orgf1a9a0d"><a href="https://time.geekbang.org/column/article/619">016 | 亚马逊领导力准则之要有硬骨头</a></h2>
<div class="outline-text-2" id="text-orgf1a9a0d">
<p>
但凡能看到的企业，从IBM到微软到谷歌，其实都无法避免官僚化，亚马逊则在最高领导层上通过贯彻领导力准则，很&#x2026;
</p>
</div>
</div>


<div id="outline-container-org3c09f85" class="outline-2">
<h2 id="org3c09f85"><a href="https://time.geekbang.org/column/article/620">017 | Hadoop三国之魏国Cloudera</a></h2>
<div class="outline-text-2" id="text-org3c09f85">
<p>
Hadoop领域曾经有三家发行商互相角逐，这其中不乏各种战术与谋略，商业的演进和帝国的历史总是惊人得相似。今天&#x2026;
</p>
</div>
</div>


<div id="outline-container-org049eedc" class="outline-2">
<h2 id="org049eedc"><a href="https://time.geekbang.org/column/article/622">018 | Hadoop三国之吴国MapR</a></h2>
<div class="outline-text-2" id="text-org049eedc">
<p>
Hadoop领域曾经有三家发行商互相角逐，这其中不乏各种战术与谋略，商业的演进和帝国的历史总是惊人得相似。MapR&#x2026;
</p>
</div>
</div>


<div id="outline-container-org8c51070" class="outline-2">
<h2 id="org8c51070"><a href="https://time.geekbang.org/column/article/623">019 | Hadoop三国之蜀国Hortonworks</a></h2>
<div class="outline-text-2" id="text-org8c51070">
<p>
Hadoop领域曾经有三家发行商互相角逐，这其中不乏各种战术与谋略，商业的演进和帝国的历史总是惊人得相似。今天&#x2026;
</p>
</div>
</div>


<div id="outline-container-org9f3f36f" class="outline-2">
<h2 id="org9f3f36f"><a href="https://time.geekbang.org/column/article/624">020 | Hadoop及其发行商的未来</a></h2>
<div class="outline-text-2" id="text-org9f3f36f">
<p>
Hadoop诞生十多年间，其生态圈逐渐兴盛又衰落，围绕其生态圈又诞生了诸多企业，而亚马逊却最终成为最大的受益者&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgf93e2d8" class="outline-2">
<h2 id="orgf93e2d8"><a href="https://time.geekbang.org/column/article/901">021 | 彼得 · 蒂尔的投资人生</a></h2>
<div class="outline-text-2" id="text-orgf93e2d8">
<p>
他是“PayPal黑帮”里的重要人物、Facebook的首位投资人、“创业圣经”《从0到1》的作者，他被誉为“硅谷创投&#x2026;
</p>
</div>
</div>


<div id="outline-container-org5629371" class="outline-2">
<h2 id="org5629371"><a href="https://time.geekbang.org/column/article/903">022 | 商业之外的彼得 · 蒂尔</a></h2>
<div class="outline-text-2" id="text-org5629371">
<p>
商业之外的彼得 · 蒂尔有着鲜明的个人理想和信念，并擅于付诸于实际行动。这是否也是其能够成功的重要因素呢&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgc375dcc" class="outline-2">
<h2 id="orgc375dcc"><a href="https://time.geekbang.org/column/article/917">023 | 创业的智慧：从彼得·蒂尔的创投哲学说起</a></h2>
<div class="outline-text-2" id="text-orgc375dcc">
<p>
彼得·蒂尔的创业和投资哲学言简意赅，似乎通俗易懂、老少皆宜，直指真理的本质，背后却有着一些值得我们去挖掘&#x2026;
</p>
</div>
</div>


<div id="outline-container-org119cc16" class="outline-2">
<h2 id="org119cc16"><a href="https://time.geekbang.org/column/article/1047">024 | 房产经纪的颠覆者Redfin：在“传统”与“现代”间徘徊</a></h2>
<div class="outline-text-2" id="text-org119cc16">
<p>
Redfin是房产经纪的颠覆者、“二手房电商”之父，之后包括链家等很多公司都复制和延伸了它的商业模式。作为如今&#x2026;
</p>
</div>
</div>


<div id="outline-container-org709f3e1" class="outline-2">
<h2 id="org709f3e1"><a href="https://time.geekbang.org/column/article/1048">025 | 房产经纪的“协作者”Zillow：一个地产数据平台</a></h2>
<div class="outline-text-2" id="text-org709f3e1">
<p>
相比房产经纪的“颠覆者”Redfin，Zillow通过建立数据平台，找到了与各大房产经纪公司的共生之道，甚至从Redfin&#x2026;
</p>
</div>
</div>


<div id="outline-container-org2698435" class="outline-2">
<h2 id="org2698435"><a href="https://time.geekbang.org/column/article/1049">026 | 颠覆还是协作，房地产市场上Redfin和Zillow的抉择</a></h2>
<div class="outline-text-2" id="text-org2698435">
<p>
技术改变世界的时代，Redfin用技术武装成新型房地产经纪公司，Zillow则构建数据平台，给传统房地产经纪公司提供&#x2026;
</p>
</div>
</div>


<div id="outline-container-org1fa9b1f" class="outline-2">
<h2 id="org1fa9b1f"><a href="https://time.geekbang.org/column/article/1282">027 | 应用交付网络大厂F5：“一招鲜”之殇</a></h2>
<div class="outline-text-2" id="text-org1fa9b1f">
<p>
F5是ADN领域的先驱，十余通过为其他互联网厂商提供设备支持来赢利。但是SDN的概念出来，微软等各大厂商开始自&#x2026;
</p>
</div>
</div>


<div id="outline-container-org8533d23" class="outline-2">
<h2 id="org8533d23"><a href="https://time.geekbang.org/column/article/1288">028 | 在线差旅报销鼻祖Concur：在转型中获得发展</a></h2>
<div class="outline-text-2" id="text-org8533d23">
<p>
作为在线差旅报销市场的领导者，Concur一路从卖软件到销售许可证，到最终成为成功的SaaS公司，不断转型并发展&#x2026;
</p>
</div>
</div>


<div id="outline-container-orged8e12e" class="outline-2">
<h2 id="orged8e12e"><a href="https://time.geekbang.org/column/article/1289">029 | 漫谈企业转型：在市场变迁中寻找生机</a></h2>
<div class="outline-text-2" id="text-orged8e12e">
<p>
企业转型是每家企业在不同时期都需要面对的选择。企业转型艰难，困难在哪里？从Concur和F5的发展经历里面，我们&#x2026;
</p>
</div>
</div>


<div id="outline-container-org416d2c1" class="outline-2">
<h2 id="org416d2c1"><a href="https://time.geekbang.org/column/article/1395">030 | 克雷公司沉浮录：行走在超级计算机市场</a></h2>
<div class="outline-text-2" id="text-org416d2c1">
<p>
克雷公司最初由“超级计算机之父”西摩 · 克雷创建，主要研发销售超级计算机，是市场上绝对的领导者，却先后&#x2026;
</p>
</div>
</div>


<div id="outline-container-org48fe847" class="outline-2">
<h2 id="org48fe847"><a href="https://time.geekbang.org/column/article/1532">031 | “单一化”的隐忧：从克雷公司看“一条腿走路”</a></h2>
<div class="outline-text-2" id="text-org48fe847">
<p>
克雷公司商业模式单一，因此“一条腿”出问题就会导致整个公司层面出问题。那么，如何成功寻找到“第二条腿”，&#x2026;
</p>
</div>
</div>


<div id="outline-container-org6e178c6" class="outline-2">
<h2 id="org6e178c6"><a href="https://time.geekbang.org/column/article/1571">032 | 亚马逊领导力准则之决策正确</a></h2>
<div class="outline-text-2" id="text-org6e178c6">
<p>
决策正确是亚马逊领导力准则之一，它强调领导者需要具备正确的决策能力。而如何才可以具备正确的决策能力，是这&#x2026;
</p>
</div>
</div>


<div id="outline-container-org11cd01d" class="outline-2">
<h2 id="org11cd01d"><a href="https://time.geekbang.org/column/article/1574">033 | Halo的开发者Bungie：与微软的聚散</a></h2>
<div class="outline-text-2" id="text-org11cd01d">
<p>
Bungie是全球最大的游戏工作室之一，曾经开发出一系列备受赞誉的游戏，并被微软收购专门开发Halo系列，让Xbox走&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgde40d62" class="outline-2">
<h2 id="orgde40d62"><a href="https://time.geekbang.org/column/article/1575">034 | “卖身”须谨慎：创业公司面临的抉择</a></h2>
<div class="outline-text-2" id="text-orgde40d62">
<p>
创业公司发展到一定阶段，经常面临被收购还是独立发展并上市的选择。但是究竟孰优孰劣，这就要看具体的收购方式&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgfc80630" class="outline-2">
<h2 id="orgfc80630"><a href="https://time.geekbang.org/column/article/1803">035 | 亚马逊领导力准则之客户至尚</a></h2>
<div class="outline-text-2" id="text-orgfc80630">
<p>
“客户至尚”是亚马逊领导力准则里面非常重要的一条，并被贝佐斯视为第一准则贯彻和落实，哪怕牺牲一部分企业利&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgfabef7e" class="outline-2">
<h2 id="orgfabef7e"><a href="https://time.geekbang.org/column/article/1875">036 | 智能音箱的战斗：亚马逊的硬件路</a></h2>
<div class="outline-text-2" id="text-orgfabef7e">
<p>
亚马逊推出的智能音箱Echo引起了广泛关注，我将通过智能音箱系列回顾这个新生事物的发展历程。让我们先来了解亚&#x2026;
</p>
</div>
</div>


<div id="outline-container-org9fd5bd6" class="outline-2">
<h2 id="org9fd5bd6"><a href="https://time.geekbang.org/column/article/1876">037 | 智能音箱的战斗：Echo攻城略地</a></h2>
<div class="outline-text-2" id="text-org9fd5bd6">
<p>
Echo曾是亚马逊硬件研发部门Lab126优先级最低的研发项目，却因Fire Phone大败而获得发展契机，并在相对保守的&#x2026;
</p>
</div>
</div>


<div id="outline-container-org8c698c0" class="outline-2">
<h2 id="org8c698c0"><a href="https://time.geekbang.org/column/article/1877">038 | 智能音箱的战斗：语音助手Alexa</a></h2>
<div class="outline-text-2" id="text-org8c698c0">
<p>
Alexa原本是亚马逊Echo音箱的语音助手，在后续发展中独立出来成为了一个软件语音平台，亚马逊又围绕Alexa平台构&#x2026;
</p>
</div>
</div>


<div id="outline-container-org117efb1" class="outline-2">
<h2 id="org117efb1"><a href="https://time.geekbang.org/column/article/1878">039 | 智能音箱的战斗：谷歌的杀入</a></h2>
<div class="outline-text-2" id="text-org117efb1">
<p>
谷歌对于智能家居市场的觊觎由来已久，在亚马逊占据两年先发优势之后，它终于杀入智能音箱市场，一次“势均力敌&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgcf45de8" class="outline-2">
<h2 id="orgcf45de8"><a href="https://time.geekbang.org/column/article/1879">040 | 智能音箱的战斗：亚马逊的战略布局</a></h2>
<div class="outline-text-2" id="text-orgcf45de8">
<p>
亚马逊对智能音箱和相关硬件的布局有自己的打算，但在谷歌入场之前以广撒网为主。但谷歌来势汹汹，亚马逊又将如&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgcaa2414" class="outline-2">
<h2 id="orgcaa2414"><a href="https://time.geekbang.org/column/article/1880">041 | 智能音箱的战斗：巨头纷纷入场</a></h2>
<div class="outline-text-2" id="text-orgcaa2414">
<p>
在谷歌入场一年后，苹果和微软也加入了智能音箱市场，国内也有诸多大厂杀入，它们将如何谋求发展和布局？
</p>
</div>
</div>


<div id="outline-container-orgc441902" class="outline-2">
<h2 id="orgc441902"><a href="https://time.geekbang.org/column/article/1881">042 | 智能音箱的战斗：白马非马</a></h2>
<div class="outline-text-2" id="text-orgc441902">
<p>
凭借语音这一天然的交互媒介火起来的智能音箱，“音箱”只是其基本属性。亚马逊、谷歌、苹果、微软，以及众多国&#x2026;
</p>
</div>
</div>


<div id="outline-container-org45b3fe2" class="outline-2">
<h2 id="org45b3fe2"><a href="https://time.geekbang.org/column/article/2328">043 | 如何透过一个领域去联合分析多家企业？</a></h2>
<div class="outline-text-2" id="text-org45b3fe2">
<p>
前面讲解了在智能音箱领域，亚马逊、谷歌、苹果、微软分别采取的入场方式和举措，并分析了其成败。那么，你是否&#x2026;
</p>
</div>
</div>


<div id="outline-container-org11921fc" class="outline-2">
<h2 id="org11921fc"><a href="https://time.geekbang.org/column/article/2329">044 | 谷歌的创新精神：好的、坏的和丑陋的（上）</a></h2>
<div class="outline-text-2" id="text-org11921fc">
<p>
谷歌可说是最具创新精神的互联网公司，创新不仅为它赢得声誉和品牌，同样给它带来实际利益。那么，谷歌是如何践&#x2026;
</p>
</div>
</div>


<div id="outline-container-org93f67ea" class="outline-2">
<h2 id="org93f67ea"><a href="https://time.geekbang.org/column/article/2449">045 | 谷歌的创新精神：好的、坏的和丑陋的（下）</a></h2>
<div class="outline-text-2" id="text-org93f67ea">
<p>
谷歌可说是最具创新精神的互联网公司，创新不仅为它赢得声誉和品牌，同样给它带来实际利益。但是事情总有两面性&#x2026;
</p>
</div>
</div>


<div id="outline-container-org5a9ce4a" class="outline-2">
<h2 id="org5a9ce4a"><a href="https://time.geekbang.org/column/article/2515">046 | 仁科：被迫再创业的David Duffield</a></h2>
<div class="outline-text-2" id="text-org5a9ce4a">
<p>
David Duffield曾经创办多家公司，三次带领公司完成上市，并在这一过程中展现了非常优秀的技术洞察力。其中，&#x2026;
</p>
</div>
</div>
