html/geekbang-tech-and-business-cases.html


<div id="outline-container-orgc1d1440" class="outline-2">
<h2 id="orgc1d1440"><a href="https://time.geekbang.org/column/article/2604">047 | 仁科：飞跃发展的企业级软件帝国</a></h2>
<div class="outline-text-2" id="text-orgc1d1440">
<p>
在大卫 · 杜菲尔德的领导下，仁科开始了飞速发展。这次高速发展以仁科软件的多元化为契机，自1992年开始一直&#x2026;
</p>
</div>
</div>


<div id="outline-container-org4d96ca1" class="outline-2">
<h2 id="org4d96ca1"><a href="https://time.geekbang.org/column/article/2606">048 | 仁科：收购和被收购</a></h2>
<div class="outline-text-2" id="text-org4d96ca1">
<p>
进入新世纪，当时企业级软件市场排名第三的仁科打算和排名第四的JD Edwards合并，强强联合以便对抗前两名的SAP&#x2026;
</p>
</div>
</div>


<div id="outline-container-org8a00b82" class="outline-2">
<h2 id="org8a00b82"><a href="https://time.geekbang.org/column/article/2608">049 | 仁科的成与败</a></h2>
<div class="outline-text-2" id="text-org8a00b82">
<p>
仁科的故事讲完了，我们来看看仁科发展过程中成功和失败的地方。“往者不可谏，来者犹可追”，历史上发生的事情&#x2026;
</p>
</div>
</div>


<div id="outline-container-org3fd847f" class="outline-2">
<h2 id="org3fd847f"><a href="https://time.geekbang.org/column/article/2693">050 | 亚马逊领导力准则之勤俭节约</a></h2>
<div class="outline-text-2" id="text-org3fd847f">
<p>
亚马逊是一家把节俭写入领导力准则的公司，它把自身成功的很大一部分原因归结于处处贯彻这一准则，但勤俭节约也&#x2026;
</p>
</div>
</div>


<div id="outline-container-org2b7c88c" class="outline-2">
<h2 id="org2b7c88c"><a href="https://time.geekbang.org/column/article/2840">051 | WorkDay：杜菲尔德复仇记</a></h2>
<div class="outline-text-2" id="text-org2b7c88c">
<p>
Oracle恶意收购仁科后立刻大裁员，仁科创始人杜菲尔德也被迫离开。为了被裁的仁科员工，也为了向Oracle复仇，&#x2026;
</p>
</div>
</div>


<div id="outline-container-org8a137b6" class="outline-2">
<h2 id="org8a137b6"><a href="https://time.geekbang.org/column/article/2900">052 | David Duffield的眼界和成败</a></h2>
<div class="outline-text-2" id="text-org8a137b6">
<p>
David Duffield是一位极具传奇色彩的创业人，先后四次创业，三次是以人力资源软件起家，而且全部成功IPO。但是&#x2026;
</p>
</div>
</div>


<div id="outline-container-org70bbdcc" class="outline-2">
<h2 id="org70bbdcc"><a href="https://time.geekbang.org/column/article/3206">053 | 分析企业的两要素：远见和执行力</a></h2>
<div class="outline-text-2" id="text-org70bbdcc">
<p>
本文介绍飞总分析企业时的一种方法：通过看企业的远见和执行力对企业进行分析。这种方法源于Gartner魔力象限图&#x2026;
</p>
</div>
</div>


<div id="outline-container-org57b75c6" class="outline-2">
<h2 id="org57b75c6"><a href="https://time.geekbang.org/column/article/3208">054 | 互联网第一股雅虎的兴衰：霸主的诞生</a></h2>
<div class="outline-text-2" id="text-org57b75c6">
<p>
雅虎诞生于1994年，最初以人工整理互联网信息的分类目录而知名，后给各大企业做显示广告，成立2年便成功上市。&#x2026;
</p>
</div>
</div>


<div id="outline-container-org754984a" class="outline-2">
<h2 id="org754984a"><a href="https://time.geekbang.org/column/article/3421">055 | 互联网第一股雅虎的兴衰：运气不敌技术</a></h2>
<div class="outline-text-2" id="text-org754984a">
<p>
雅虎在互联网泡沫破灭时遭受重创，同时迎来新CEO塞梅尔，此后在商业上采取了一系列措施，包括分别购买搜索引擎&#x2026;
</p>
</div>
</div>


<div id="outline-container-org0ea2d4e" class="outline-2">
<h2 id="org0ea2d4e"><a href="https://time.geekbang.org/column/article/3618">056 | 互联网第一股雅虎的兴衰：没有救世主</a></h2>
<div class="outline-text-2" id="text-org0ea2d4e">
<p>
杨致远曾在全球复制雅虎的成功，而雅虎美国却在塞梅尔的带领下连连失利，杨致远回归做CEO却也英雄败北，此后便&#x2026;
</p>
</div>
</div>


<div id="outline-container-orge2971e4" class="outline-2">
<h2 id="orge2971e4"><a href="https://time.geekbang.org/column/article/3640">057 | 成也杨致远，败也杨致远</a></h2>
<div class="outline-text-2" id="text-orge2971e4">
<p>
雅虎曾经是互联网上访问量最大的网站，是曾经的“互联网第一股”，但是其后来的发展却每况愈下。无论前期的成功&#x2026;
</p>
</div>
</div>


<div id="outline-container-org7f3edfb" class="outline-2">
<h2 id="org7f3edfb"><a href="https://time.geekbang.org/column/article/3642">058 | 企业因人成事，领导人很重要</a></h2>
<div class="outline-text-2" id="text-org7f3edfb">
<p>
“兵熊熊一个，将熊熊一窝。”一个企业最后所能达成的成就，往往和企业的领导人有莫大的关系。因此，通过分析企&#x2026;
</p>
</div>
</div>


<div id="outline-container-org3f73c25" class="outline-2">
<h2 id="org3f73c25"><a href="https://time.geekbang.org/column/article/3674">059 | 亚马逊领导力准则之主人翁精神</a></h2>
<div class="outline-text-2" id="text-org3f73c25">
<p>
主人翁精神似乎老生常谈，但在亚马逊领导力准则里却有很重要的地位和比较明确的定义，主要体现在两个方面：一是&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgc0cefb2" class="outline-2">
<h2 id="orgc0cefb2"><a href="https://time.geekbang.org/column/article/3675">060 | 半条命的Dota帝国Valve：半条命</a></h2>
<div class="outline-text-2" id="text-orgc0cefb2">
<p>
知名游戏公司Valve，创始人均出身微软，是Windows操作系统的早期开发者，衣食无忧选择创业。它在创立早期就成功&#x2026;
</p>
</div>
</div>


<div id="outline-container-org5b17ee3" class="outline-2">
<h2 id="org5b17ee3"><a href="https://time.geekbang.org/column/article/3676">061 | 半条命的Dota帝国Valve：Steam平台</a></h2>
<div class="outline-text-2" id="text-org5b17ee3">
<p>
《半条命3》始终没有出现，Valve在专心打造“游戏界的iTunes”，即自己的游戏平台Steam，并不惜借助自己的多款&#x2026;
</p>
</div>
</div>


<div id="outline-container-org39859a7" class="outline-2">
<h2 id="org39859a7"><a href="https://time.geekbang.org/column/article/3677">062 | 半条命的Dota帝国Valve：Dota 2</a></h2>
<div class="outline-text-2" id="text-org39859a7">
<p>
Dota 2的加入，让Steam平台得以将更多游戏展现给更多玩家。这种相辅相成的发展模式，让Valve公司的未来呈现&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgd87c917" class="outline-2">
<h2 id="orgd87c917"><a href="https://time.geekbang.org/column/article/3678">063 | 半条命的Dota帝国Valve：无领导管理</a></h2>
<div class="outline-text-2" id="text-orgd87c917">
<p>
Valve公司奉行一种无领导管理的理念，公司所有人都是平级的。一家公司没有老板，干活凭兴趣，招人看缘分，这可&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgfcb237a" class="outline-2">
<h2 id="orgfcb237a"><a href="https://time.geekbang.org/column/article/3679">064 | 半条命的Dota帝国Valve：虚拟现实</a></h2>
<div class="outline-text-2" id="text-orgfcb237a">
<p>
Valve以创新著称，《半条命》最早引入游戏情节，游戏分发平台Steam更是早于iTunes，如今更与HTC合作Vive，为游&#x2026;
</p>
</div>
</div>


<div id="outline-container-org33324c4" class="outline-2">
<h2 id="org33324c4"><a href="https://time.geekbang.org/column/article/4209">065 | Gabe Newell：Valve帝国制度的利弊</a></h2>
<div class="outline-text-2" id="text-org33324c4">
<p>
Valve是一家非常成功的游戏公司，其制度、运作方式极具特色。然而，Valve的优点和缺点都极为鲜明，却不可复制。
</p>
</div>
</div>


<div id="outline-container-org484ca01" class="outline-2">
<h2 id="org484ca01"><a href="https://time.geekbang.org/column/article/4321">066 | 管中窥豹之从面试看企业文化：微软</a></h2>
<div class="outline-text-2" id="text-org484ca01">
<p>
微软的招聘过程自成体系很有特色，具有AA资格的人拥有最终决定权。这背后，则是一套自上而下的管理模式和领导者&#x2026;
</p>
</div>
</div>


<div id="outline-container-org722c803" class="outline-2">
<h2 id="org722c803"><a href="https://time.geekbang.org/column/article/4339">067 | 管中窥豹之从面试看企业文化：亚马逊</a></h2>
<div class="outline-text-2" id="text-org722c803">
<p>
亚马逊的领导力准则就像企业文化的DNA，并且极为知名。在招聘这件事情上，亚马逊也是处处体现它的领导力准则。&#x2026;
</p>
</div>
</div>


<div id="outline-container-org5428730" class="outline-2">
<h2 id="org5428730"><a href="https://time.geekbang.org/column/article/4344">068 | 管中窥豹之从面试看企业文化：谷歌</a></h2>
<div class="outline-text-2" id="text-org5428730">
<p>
作为硅谷新兴互联网企业代表的谷歌，面试遵循了一套完全不同的模式。这种模式被硅谷的其他互联网上市公司和尚未&#x2026;
</p>
</div>
</div>


<div id="outline-container-orga043d77" class="outline-2">
<h2 id="orga043d77"><a href="https://time.geekbang.org/column/article/4346">069 | 管中窥豹之从面试看企业文化：甲骨文</a></h2>
<div class="outline-text-2" id="text-orga043d77">
<p>
甲骨文是硅谷老牌公司的代表，面试规则充分体现出了其作为老牌硅谷公司“唯出身论”的特质。
</p>
</div>
</div>


<div id="outline-container-orga1c6b17" class="outline-2">
<h2 id="orga1c6b17"><a href="https://time.geekbang.org/column/article/4351">070 | 管中窥豹之从面试看企业文化：Facebook</a></h2>
<div class="outline-text-2" id="text-orga1c6b17">
<p>
Facebook的面试有很多模仿谷歌的痕迹，却也独具特色。“勤奋”是它非常重要的企业文化，并在面试中得到了体现。
</p>
</div>
</div>


<div id="outline-container-org88ff237" class="outline-2">
<h2 id="org88ff237"><a href="https://time.geekbang.org/column/article/4477">071 | 透过企业用人之道看企业发展</a></h2>
<div class="outline-text-2" id="text-org88ff237">
<p>
企业用人之道能够反映出企业特质，也决定着企业的发展。而和员工息息相关的招聘、升迁，正是我们管中窥豹分析企&#x2026;
</p>
</div>
</div>


<div id="outline-container-org81cd383" class="outline-2">
<h2 id="org81cd383"><a href="https://time.geekbang.org/column/article/4772">072 | Zenefits：一个卖保险的创业公司</a></h2>
<div class="outline-text-2" id="text-org81cd383">
<p>
Zenefits是创业圈里迅速升起的独角兽，但创始人“利令智昏”的一系列违规操作，又让其迅速倒下。企业作弊式扩张&#x2026;
</p>
</div>
</div>


<div id="outline-container-org6840c88" class="outline-2">
<h2 id="org6840c88"><a href="https://time.geekbang.org/column/article/4896">073 | Glassdoor：让公司信息对个人透明</a></h2>
<div class="outline-text-2" id="text-org6840c88">
<p>
求职市场上，公司和求职者之间信息向来不对等。Glassdoor致力于解决这一痛点，让公司信息对个人透明，并借由发&#x2026;
</p>
</div>
</div>


<div id="outline-container-org3845e43" class="outline-2">
<h2 id="org3845e43"><a href="https://time.geekbang.org/column/article/4897">074 | 从巴顿的创业史看巴顿</a></h2>
<div class="outline-text-2" id="text-org3845e43">
<p>
巴顿先后创立了Expedia、Zillow和Glassdoor，第三次创业时已经财富自由，所以他是真正为了做事而做事。巴顿创业&#x2026;
</p>
</div>
</div>


<div id="outline-container-org5835d7c" class="outline-2">
<h2 id="org5835d7c"><a href="https://time.geekbang.org/column/article/4999">075 | 办公软件的战斗：开篇</a></h2>
<div class="outline-text-2" id="text-org5835d7c">
<p>
很多企业不是死于外敌，而是自己太作；很多企业不够作，却败于没有跟上时代的变化。我们将回到20世纪80年代，观&#x2026;
</p>
</div>
</div>


<div id="outline-container-org754ed18" class="outline-2">
<h2 id="org754ed18"><a href="https://time.geekbang.org/column/article/5094">076 | VisiCalc：第一个电子表格软件的诞生</a></h2>
<div class="outline-text-2" id="text-org754ed18">
<p>
Excel已是电子表格软件的事实标准，是人们工作中不可或缺的一部分，但电子表格并非Excel首创。
</p>
</div>
</div>


<div id="outline-container-org405edae" class="outline-2">
<h2 id="org405edae"><a href="https://time.geekbang.org/column/article/5196">077 | 亚马逊领导力准则之选贤育能</a></h2>
<div class="outline-text-2" id="text-org405edae">
<p>
招聘到可提升公司整体水平的新员工，这条内容被写进了亚马逊的领导力准则。亚马逊还因此诞生了一个独特的角色：&#x2026;
</p>
</div>
</div>


<div id="outline-container-org42406f8" class="outline-2">
<h2 id="org42406f8"><a href="https://time.geekbang.org/column/article/5349">078 | WordStar：第一个字处理软件的故事</a></h2>
<div class="outline-text-2" id="text-org42406f8">
<p>
WordStar作为第一个字处理软件，在办公软件历史上有着举足轻重的地位，开发商MicroPro一度借它成为全球最大的软&#x2026;
</p>
</div>
</div>


<div id="outline-container-org87d2170" class="outline-2">
<h2 id="org87d2170"><a href="https://time.geekbang.org/column/article/5524">079 | 微软：办公软件战场的螳螂</a></h2>
<div class="outline-text-2" id="text-org87d2170">
<p>
“螳螂捕蝉，黄雀在后。”在办公软件领域，微软在电子表格和字处理软件领域都向当时的霸主发起了挑战，却一次又&#x2026;
</p>
</div>
</div>


<div id="outline-container-org16ad54e" class="outline-2">
<h2 id="org16ad54e"><a href="https://time.geekbang.org/column/article/5572">080 | 亚马逊领导力准则之最高标准</a></h2>
<div class="outline-text-2" id="text-org16ad54e">
<p>
“最高标准”这条亚马逊领导力准则与“选贤育能”相关联，亚马逊坚持选用最优秀的人才，来保证贯彻对于常人来说&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgfd4cb73" class="outline-2">
<h2 id="orgfd4cb73"><a href="https://time.geekbang.org/column/article/5635">081 | WordPerfect：字处理软件的新秀</a></h2>
<div class="outline-text-2" id="text-orgfd4cb73">
<p>
微软正面进攻WordStar，却被不起眼的WordPerfect反超，后者更通过独特的推广和服务方式，成功坐上新一代字处理&#x2026;
</p>
</div>
</div>


<div id="outline-container-org08ef3a3" class="outline-2">
<h2 id="org08ef3a3"><a href="https://time.geekbang.org/column/article/5711">082 | Lotus 1-2-3：莲花公司的电子表格帝国</a></h2>
<div class="outline-text-2" id="text-org08ef3a3">
<p>
和字处理软件市场一样，微软在电子表格市场也遭遇了劲敌：莲花公司。在软件发展史上具有里程碑意义的Lotus 1-&#x2026;
</p>
</div>
</div>
