html/geekbang-tech-and-business-cases.html


<div id="outline-container-org1430c63" class="outline-2">
<h2 id="org1430c63"><a href="https://time.geekbang.org/column/article/5722">083 | 亚马逊领导力准则之创新简化</a></h2>
<div class="outline-text-2" id="text-org1430c63">
<p>
贝佐斯认为“创新”和“简化”密不可分，创新的过程中更要眼界开阔，并做好接受被长期误解的准备。
</p>
</div>
</div>


<div id="outline-container-org7186452" class="outline-2">
<h2 id="org7186452"><a href="https://time.geekbang.org/column/article/5826">084 | 红狮会战：微软的反击</a></h2>
<div class="outline-text-2" id="text-org7186452">
<p>
微软屡战屡败，决定组织一次“红狮会战”再次进军电子表格市场。全新产品Excel就此诞生，微软不惜抛开自家产品&#x2026;
</p>
</div>
</div>


<div id="outline-container-org42f8944" class="outline-2">
<h2 id="org42f8944"><a href="https://time.geekbang.org/column/article/6053">085 | 大杀器Lotus Notes 和被收购的莲花公司</a></h2>
<div class="outline-text-2" id="text-org42f8944">
<p>
微软通过“红狮会战”终于取胜电子表格战场，莲花公司决定避开正面交锋，转而推出领先时代二十年的企业协作系统&#x2026;
</p>
</div>
</div>


<div id="outline-container-org88ceec4" class="outline-2">
<h2 id="org88ceec4"><a href="https://time.geekbang.org/column/article/6179">086 | 亚马逊领导力准则之崇尚行动</a></h2>
<div class="outline-text-2" id="text-org88ceec4">
<p>
在亚马逊里面，一件事情如果不是很确定，亚马逊的领导力准则倾向于先采取行动，边做边看。这正是“崇尚行动”的&#x2026;
</p>
</div>
</div>


<div id="outline-container-org3571502" class="outline-2">
<h2 id="org3571502"><a href="https://time.geekbang.org/column/article/6185">087 | 无敌寂寞的微软之为创新而创新</a></h2>
<div class="outline-text-2" id="text-org3571502">
<p>
微软终于成了办公软件的霸主，此时却创新疲软，只是不断迭代软件版本，创收成了问题。此时，微软似乎为创新而创&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgb1a03f2" class="outline-2">
<h2 id="orgb1a03f2"><a href="https://time.geekbang.org/column/article/6333">088 | 办公软件的新时代：微软和谷歌的战斗</a></h2>
<div class="outline-text-2" id="text-orgb1a03f2">
<p>
在微软的办公软件帝国，Google Docs带着“云服务”和“协同办公”两大利器闯入，并狠赚了一把眼球儿。但微软却&#x2026;
</p>
</div>
</div>


<div id="outline-container-org47aa794" class="outline-2">
<h2 id="org47aa794"><a href="https://time.geekbang.org/column/article/6337">089 | 亚马逊领导力准则之远见卓识</a></h2>
<div class="outline-text-2" id="text-org47aa794">
<p>
亚马逊要求领导者要有“远见卓识”，要从多角度多维度纵深思考问题，从而产生良好的结果。
</p>
</div>
</div>


<div id="outline-container-org5167e37" class="outline-2">
<h2 id="org5167e37"><a href="https://time.geekbang.org/column/article/6534">090 | 异军突起的Slack</a></h2>
<div class="outline-text-2" id="text-org5167e37">
<p>
新时代有新挑战，遭遇谷歌之后，微软的霸主地位又受到了新创公司Slack，这家企业协同软件厂商的挑战。为此，微&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgc390caf" class="outline-2">
<h2 id="orgc390caf"><a href="https://time.geekbang.org/column/article/6542">091 | 办公软件战斗的启示：内忧总是强于外患</a></h2>
<div class="outline-text-2" id="text-orgc390caf">
<p>
办公软件行业的战斗史告诉我们，“内忧”往往是终结企业命运的罪魁祸首。
</p>
</div>
</div>


<div id="outline-container-orgc024bba" class="outline-2">
<h2 id="orgc024bba"><a href="https://time.geekbang.org/column/article/6760">092 | 亚马逊领导力准则之好奇求知与赢得信任</a></h2>
<div class="outline-text-2" id="text-orgc024bba">
<p>
领导者需要有“好奇求知”的精神，和“赢得信任”的能力，也就是不断探索外部世界，不断学习提高并能够付诸行动&#x2026;
</p>
</div>
</div>


<div id="outline-container-org525396f" class="outline-2">
<h2 id="org525396f"><a href="https://time.geekbang.org/column/article/6764">093 | 办公软件战斗的启示：敌人的出现常常出其不意</a></h2>
<div class="outline-text-2" id="text-org525396f">
<p>
办公软件的战斗告诉我们，敌人的出现，不一定在同一个领域，有时候一个领域、一个产品被颠覆，甚至可能是看起来&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgf9a28da" class="outline-2">
<h2 id="orgf9a28da"><a href="https://time.geekbang.org/column/article/6984">094 | 亚马逊领导力准则之刨根问底与达成业绩</a></h2>
<div class="outline-text-2" id="text-orgf9a28da">
<p>
“刨根问底”要求领导者深入各个环节，掌握细节，经常审核，不遗漏任何工作。但这还不够，你还必须能够“达成业&#x2026;
</p>
</div>
</div>


<div id="outline-container-org6f1550f" class="outline-2">
<h2 id="org6f1550f"><a href="https://time.geekbang.org/column/article/7140">095 | 谷歌的大数据路：从“三驾马车”到一无所有</a></h2>
<div class="outline-text-2" id="text-org6f1550f">
<p>
谷歌的“三架马车”开启了大数据时代，然而在这个新时代里，谷歌却既无江湖地位也没赚到钱。那么，谷歌究竟是如&#x2026;
</p>
</div>
</div>


<div id="outline-container-org04aeb1f" class="outline-2">
<h2 id="org04aeb1f"><a href="https://time.geekbang.org/column/article/7291">096 | 谷歌的大数据路：一场影响深远的论战</a></h2>
<div class="outline-text-2" id="text-org04aeb1f">
<p>
在大数据发展史上，以迈克尔 · 斯通布雷克为代表的数据库元老级人物，针对MapReduce向谷歌提出了质疑。这场&#x2026;
</p>
</div>
</div>


<div id="outline-container-org7c04b76" class="outline-2">
<h2 id="org7c04b76"><a href="https://time.geekbang.org/column/article/7487">097 | 谷歌的大数据路：谷歌的“黑科技”</a></h2>
<div class="outline-text-2" id="text-org7c04b76">
<p>
在大数据的路上，前半场谷歌以“三驾马车”开始，但因为决策失误丧失了先发优势；而在大数据的下半场，谷歌携带&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgc3c096a" class="outline-2">
<h2 id="orgc3c096a"><a href="https://time.geekbang.org/column/article/7493">098 | 如何读懂类似谷歌“三驾马车”这样的技术论文？</a></h2>
<div class="outline-text-2" id="text-orgc3c096a">
<p>
读懂一篇技术论文，首先需要明白“论文是写给谁看的”和“论文是怎么写出来的”这两个基本问题，然后就可以有针&#x2026;
</p>
</div>
</div>


<div id="outline-container-org415536d" class="outline-2">
<h2 id="org415536d"><a href="https://time.geekbang.org/column/article/7705">099 | 雅虎：大数据领域的“活雷锋”</a></h2>
<div class="outline-text-2" id="text-org415536d">
<p>
雅虎，这个早已消逝在我们视线中的公司，却是大数据领域的“活雷锋”，可以说正是它成就了今天的Hadoop生态圈。
</p>
</div>
</div>


<div id="outline-container-org44a0c1a" class="outline-2">
<h2 id="org44a0c1a"><a href="https://time.geekbang.org/column/article/7964">100 | IBM的大数据路之起早贪黑赶了晚集</a></h2>
<div class="outline-text-2" id="text-org44a0c1a">
<p>
作为历史悠久的计算机公司，IBM早早进入了大数据领域，最终却一事无成，只能寄希望于比它起步还要晚的Spark。
</p>
</div>
</div>


<div id="outline-container-orgc4f0ec1" class="outline-2">
<h2 id="orgc4f0ec1"><a href="https://time.geekbang.org/column/article/7965">101 | 社交公司们的大数据贡献</a></h2>
<div class="outline-text-2" id="text-orgc4f0ec1">
<p>
雅虎把Hadoop开源以后，当时著名的三大社交公司Facebook、LinkedIn和Twitter都加入了这个生态圈，并做出了巨大&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgc5b7780" class="outline-2">
<h2 id="orgc5b7780"><a href="https://time.geekbang.org/column/article/8211">102 | 微软的大数据发展史：微软硅谷研究院</a></h2>
<div class="outline-text-2" id="text-orgc5b7780">
<p>
微软硅谷研究院曾在微软的大数据发展史上扮演了非常奇特的角色，它推出的Dryad和DryadLINQ可以说是两个另类，&#x2026;
</p>
</div>
</div>


<div id="outline-container-org5451071" class="outline-2">
<h2 id="org5451071"><a href="https://time.geekbang.org/column/article/8212">103 | 微软的大数据发展史：必应的Cosmos</a></h2>
<div class="outline-text-2" id="text-org5451071">
<p>
Cosmos是微软必应搜索引擎下开发的大数据基础架构，代表了微软在大数据方面的最高成就。
</p>
</div>
</div>


<div id="outline-container-orgf3d0c54" class="outline-2">
<h2 id="orgf3d0c54"><a href="https://time.geekbang.org/column/article/8468">104 | 微软的大数据发展史：Azure的大数据发展</a></h2>
<div class="outline-text-2" id="text-orgf3d0c54">
<p>
微软大数据发展史上的另一个分支，是云计算平台下的大数据项目Azure。微软在这个项目上投入巨大，但最后只有Co&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgee9cee4" class="outline-2">
<h2 id="orgee9cee4"><a href="https://time.geekbang.org/column/article/8570">105 | 亚马逊的大数据故事：从先驱者到插管吸血开源</a></h2>
<div class="outline-text-2" id="text-orgee9cee4">
<p>
亚马逊对大数据的贡献，除了发展早期的Dynamo系统的论文外，对大数据圈的贡献基本上是负数，但却从中获得了巨&#x2026;
</p>
</div>
</div>


<div id="outline-container-org2b3083f" class="outline-2">
<h2 id="org2b3083f"><a href="https://time.geekbang.org/column/article/8747">106 | 亚马逊的大数据故事：创新和拿来并存的云服务</a></h2>
<div class="outline-text-2" id="text-org2b3083f">
<p>
亚马逊除了在Hadoop生态系统里蓬勃发展，还推出了自己的数据分析产品。这些产品有些是亚马逊自己研发的，有些则&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgd979f93" class="outline-2">
<h2 id="orgd979f93"><a href="https://time.geekbang.org/column/article/8770">107 | 阿里巴巴的大数据故事：数据分析平台发展史</a></h2>
<div class="outline-text-2" id="text-orgd979f93">
<p>
国内大数据平台做得最好的公司当属阿里巴巴。今天我们介绍一下阿里巴巴数据分析平台的发展情况。
</p>
</div>
</div>


<div id="outline-container-org9dca148" class="outline-2">
<h2 id="org9dca148"><a href="https://time.geekbang.org/column/article/9015">108 | 阿里巴巴的大数据故事：流计算引擎发展史</a></h2>
<div class="outline-text-2" id="text-org9dca148">
<p>
流数据处理在阿里巴巴的发展过程中一直十分重要，阿里巴巴也在此基础上做出了很多有意义的项目。今天我们就来介&#x2026;
</p>
</div>
</div>


<div id="outline-container-orga5d98a3" class="outline-2">
<h2 id="orga5d98a3"><a href="https://time.geekbang.org/column/article/9017">109 | 大公司的大数据战略得失：自建轮子成本高</a></h2>
<div class="outline-text-2" id="text-orga5d98a3">
<p>
在大公司里，大数据平台一般分为两类，一类是自己搭的基础架构，一类是抱团取暖用的Hadoop生态圈，这两者各有利&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgf9e463e" class="outline-2">
<h2 id="orgf9e463e"><a href="https://time.geekbang.org/column/article/9019">110 | 大公司的大数据战略得失：抱团取暖难敌插管吸血者</a></h2>
<div class="outline-text-2" id="text-orgf9e463e">
<p>
开源项目最讨厌的就是只进不出的参与者。一个公司如果只把开源项目拿去赚钱，却不拿自己的改动和成果反哺社区，&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgf3bddb2" class="outline-2">
<h2 id="orgf3bddb2"><a href="https://time.geekbang.org/column/article/9327">111 | Palantir：神秘的大数据独角兽</a></h2>
<div class="outline-text-2" id="text-orgf3bddb2">
<p>
Palantir是一家神秘的大数据创业公司，由硅谷著名投资人彼得·蒂尔创办，其主要服务对象是美国政府部门、特情组&#x2026;
</p>
</div>
</div>


<div id="outline-container-org1c5fb48" class="outline-2">
<h2 id="org1c5fb48"><a href="https://time.geekbang.org/column/article/9328">112 | Splunk：机器大数据的分析帝国</a></h2>
<div class="outline-text-2" id="text-org1c5fb48">
<p>
Splunk是大数据圈里少有的盈利并且蓬勃发展的企业。它主要服务在机器日志数据分析领域，随后又不断拓展业务，演&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgfb8ea9b" class="outline-2">
<h2 id="orgfb8ea9b"><a href="https://time.geekbang.org/column/article/2412">113 | Confluent：在Kafka上飞驰的数据交换者</a></h2>
<div class="outline-text-2" id="text-orgfb8ea9b">
<p>
今天我们要讲的大数据公司叫作Confluent，这个公司是前LinkedIn员工出来后联合创办的，而创业的基础是一款叫作A&#x2026;
</p>
</div>
</div>


<div id="outline-container-org5abd565" class="outline-2">
<h2 id="org5abd565"><a href="https://time.geekbang.org/column/article/9329">114 | Powerset：HBase的老东家</a></h2>
<div class="outline-text-2" id="text-org5abd565">
<p>
Powerset是一家被微软收购多年的创业公司，目前在语义搜索方面创业。它为开源社区贡献了BigTable的Hadoop版实现&#x2026;
</p>
</div>
</div>


<div id="outline-container-org6be8fe9" class="outline-2">
<h2 id="org6be8fe9"><a href="https://time.geekbang.org/column/article/9889">115 | Cassandra和DataStax的故事</a></h2>
<div class="outline-text-2" id="text-org6be8fe9">
<p>
Cassandra是开源社区Dynamo的仿品，最初由Facebook开发并开源，后被抛弃。而DataStax对它的支持，才有了它今天&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgb435298" class="outline-2">
<h2 id="orgb435298"><a href="https://time.geekbang.org/column/article/10041">116 | Databricks之Spark的数据金砖王国</a></h2>
<div class="outline-text-2" id="text-orgb435298">
<p>
Spark是Hadoop生态圈里大红大紫的项目，它甚至已经取代了Hadoop MapReduce的地位。Databricks是商业化这个项目&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgfa10d8c" class="outline-2">
<h2 id="orgfa10d8c"><a href="https://time.geekbang.org/column/article/10052">117 | Data Artisans：浴火重生的新一代大数据计算引擎Flink</a></h2>
<div class="outline-text-2" id="text-orgfa10d8c">
<p>
Apache Flink是一个年轻的新型处理引擎，是Hadoop社区里Spark的主要竞争对手。Flink设计理念先进，但是工程实&#x2026;
</p>
</div>
</div>
