html/geekbang-tech-and-business-cases.html


<div id="outline-container-org07696dd" class="outline-2">
<h2 id="org07696dd"><a href="https://time.geekbang.org/column/article/10054">118 | Dremio:在Drill和Arrow上的大数据公司</a></h2>
<div class="outline-text-2" id="text-org07696dd">
<p>
Dremio是另外一家大数据创业公司，创始人从MapR出来后，以开源Arrow为核心制作了Dremio项目。
</p>
</div>
</div>


<div id="outline-container-org7bd080d" class="outline-2">
<h2 id="org7bd080d"><a href="https://time.geekbang.org/column/article/10056">119 | Imply：基于Druid的大数据分析公司</a></h2>
<div class="outline-text-2" id="text-org7bd080d">
<p>
开源大数据项目Druid由Metamarkets开发。开始时籍籍无名，后来被一些大公司，尤其是Airbnb使用和推广以后，受到&#x2026;
</p>
</div>
</div>


<div id="outline-container-orga25945f" class="outline-2">
<h2 id="orga25945f"><a href="https://time.geekbang.org/column/article/10058">120 | Kyligence：阿帕奇麒麟背后的大数据公司</a></h2>
<div class="outline-text-2" id="text-orga25945f">
<p>
Apache Kylin是第一个全部由中国人主导的Hadoop生态圈的开源项目。Kyligence则是这个项目背后负责商业化的公&#x2026;
</p>
</div>
</div>


<div id="outline-container-org6f3f8f2" class="outline-2">
<h2 id="org6f3f8f2"><a href="https://time.geekbang.org/column/article/10059">121 | Snowflake:云端的弹性数据仓库</a></h2>
<div class="outline-text-2" id="text-org6f3f8f2">
<p>
Snowflake是一个构建在云端的弹性数据仓库，也是这个产品背后公司的名字。它的创始人和管理层都有强大的背景。
</p>
</div>
</div>


<div id="outline-container-orga1cb15a" class="outline-2">
<h2 id="orga1cb15a"><a href="https://time.geekbang.org/column/article/10942">122 | TiDB：一个国产新数据库的创业故事</a></h2>
<div class="outline-text-2" id="text-orga1cb15a">
<p>
TiDB是位于北京的一家创业公司PingCAP的产品，它的目标是实现一个开源的类似谷歌Spanner一样的系统，这个产品非&#x2026;
</p>
</div>
</div>


<div id="outline-container-org9c9c258" class="outline-2">
<h2 id="org9c9c258"><a href="https://time.geekbang.org/column/article/10945">123 | 大数据创业公司的前景：红海创业多艰辛</a></h2>
<div class="outline-text-2" id="text-org9c9c258">
<p>
创业通常有红海和蓝海的说法，蓝海容易红海艰难。对大数据创业公司来说，蓝海多半指的是做应用层面的，而红海则&#x2026;
</p>
</div>
</div>


<div id="outline-container-org7fcc8bb" class="outline-2">
<h2 id="org7fcc8bb"><a href="https://time.geekbang.org/column/article/10946">124 | 如何通过企业技术积累去分析一家企业？</a></h2>
<div class="outline-text-2" id="text-org7fcc8bb">
<p>
通过技术积累分析一家企业是一种行之有效的办法，我们需要关注三个方面：技术适用的场景是否有巨大的盈利空间，&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgf0fdaf0" class="outline-2">
<h2 id="orgf0fdaf0"><a href="https://time.geekbang.org/column/article/10947">125 | Facebook的黑客精神</a></h2>
<div class="outline-text-2" id="text-orgf0fdaf0">
<p>
“Move Fast and Break Things”是Facebook创始人马克·扎克伯格的名言。它的意思是让公司尽快开发尽快发布&#x2026;
</p>
</div>
</div>


<div id="outline-container-org1bf1e8a" class="outline-2">
<h2 id="org1bf1e8a"><a href="https://time.geekbang.org/column/article/10953">126 | Twitter：蓝色小鸟还能飞多久（上）</a></h2>
<div class="outline-text-2" id="text-org1bf1e8a">
<p>
今天我们一起看看Twitter的早期发展史，并了解一下杰克·多西这个Twitter的早期创业人员和CEO，发挥了什么作用&#x2026;
</p>
</div>
</div>


<div id="outline-container-org8b58659" class="outline-2">
<h2 id="org8b58659"><a href="https://time.geekbang.org/column/article/10958">127 | Twitter：蓝色小鸟还能飞多久（下）</a></h2>
<div class="outline-text-2" id="text-org8b58659">
<p>
伴随着Twitter的上市，最终杰克如愿以偿再次回到Twitter做CEO，但是Twitter因为缺乏盈利能力，而导致股价一度下&#x2026;
</p>
</div>
</div>


<div id="outline-container-org43e15ef" class="outline-2">
<h2 id="org43e15ef"><a href="https://time.geekbang.org/column/article/10959">128 | 赚钱是根本，换CEO也没救</a></h2>
<div class="outline-text-2" id="text-org43e15ef">
<p>
对于企业来说，盈利是非常重要的。Twitter既不能做到现在盈利，也不告诉大家将来怎么盈利，只是通过不断换CEO来&#x2026;
</p>
</div>
</div>


<div id="outline-container-org20da912" class="outline-2">
<h2 id="org20da912"><a href="https://time.geekbang.org/column/article/10960">129 | Square：手机POS机和比特币交易</a></h2>
<div class="outline-text-2" id="text-org20da912">
<p>
Square是杰克 · 多西被迫离开Twitter管理层以后创立的公司，它的主要经营方式是通过为客户提供移动收款能力&#x2026;
</p>
</div>
</div>


<div id="outline-container-org2bdf855" class="outline-2">
<h2 id="org2bdf855"><a href="https://time.geekbang.org/column/article/12344">130 | 创意很重要，但不是一切</a></h2>
<div class="outline-text-2" id="text-org2bdf855">
<p>
创业公司中创意很重要，但是创业公司要长久发展下去，还需要创意以外的东西，要有长期一贯的执行能力和在关键时&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgb2f80fc" class="outline-2">
<h2 id="orgb2f80fc"><a href="https://time.geekbang.org/column/article/12355">131 | 杰克·多西：分身有术之兼任两家上市公司CEO</a></h2>
<div class="outline-text-2" id="text-orgb2f80fc">
<p>
杰克·多西目前身兼Twitter和Square两家公司CEO，是近些年互联网行业颇具影响力的人物，很多人将他视为“活着的&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgbe09f80" class="outline-2">
<h2 id="orgbe09f80"><a href="https://time.geekbang.org/column/article/12356">132 | Groupon：团购鼻祖的兴衰</a></h2>
<div class="outline-text-2" id="text-orgbe09f80">
<p>
团购浪潮兴起于美国一家叫做Groupon的公司。然而，它在美国的发展却是一波三折，经历了高潮，又历经了衰落，如&#x2026;
</p>
</div>
</div>


<div id="outline-container-org5f6d065" class="outline-2">
<h2 id="org5f6d065"><a href="https://time.geekbang.org/column/article/12357">133 | 卖掉自己是不是更好</a></h2>
<div class="outline-text-2" id="text-org5f6d065">
<p>
创业公司发展到一定阶段有两条路：被收购和上市。到底哪条路更好，今天我就来分析一下这个复杂的问题。
</p>
</div>
</div>


<div id="outline-container-org7128b64" class="outline-2">
<h2 id="org7128b64"><a href="https://time.geekbang.org/column/article/12360">134 | 企业在线存储Box</a></h2>
<div class="outline-text-2" id="text-org7128b64">
<p>
Box是最早进入到在线存储行业的公司。“从无到有”的过程中，Box将业务的重点转变到企业用户上来。后又深耕垂直&#x2026;
</p>
</div>
</div>


<div id="outline-container-org190bb63" class="outline-2">
<h2 id="org190bb63"><a href="https://time.geekbang.org/column/article/12368">135 | 个人在线存储 Dropbox</a></h2>
<div class="outline-text-2" id="text-org190bb63">
<p>
Dropbox是个人在线存储领域最大的公司，起初专注于个人在线存储服务，但是近几年也进行了一些其他商务扩展。
</p>
</div>
</div>


<div id="outline-container-orgb678f66" class="outline-2">
<h2 id="orgb678f66"><a href="https://time.geekbang.org/column/article/12369">136 | 做产品先做消费者市场，还是先做企业市场</a></h2>
<div class="outline-text-2" id="text-orgb678f66">
<p>
Box和Dropbox是两家在存储领域很有名的公司。前者专注于企业市场，后者则专注于个人消费者市场，
</p>
</div>
</div>


<div id="outline-container-org4baaee6" class="outline-2">
<h2 id="org4baaee6"><a href="https://time.geekbang.org/column/article/12370">137 | 今天我们都来Pin图片之Pinterest的图片社交路</a></h2>
<div class="outline-text-2" id="text-org4baaee6">
<p>
Pinterest是目前最大的图片社交网站，但至今尚未IPO。它的主要盈利模式就是通过广告。
</p>
</div>
</div>


<div id="outline-container-org04059fa" class="outline-2">
<h2 id="org04059fa"><a href="https://time.geekbang.org/column/article/12371">138 | 企业不上市为哪般</a></h2>
<div class="outline-text-2" id="text-org04059fa">
<p>
加入一个创业公司，尤其是独角兽公司，很多人是冲着股票上市去的。但是有些独角兽公司却选择不上市或者不急着上&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgc31c475" class="outline-2">
<h2 id="orgc31c475"><a href="https://time.geekbang.org/column/article/13802">139 | 微软的综合工程师改革</a></h2>
<div class="outline-text-2" id="text-orgc31c475">
<p>
陆奇在就职于微软的那几年，推行了一场综合工程师改革。整个微软的研发部门所有的开发人员和测试人员合并，每个&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgfaee257" class="outline-2">
<h2 id="orgfaee257"><a href="https://time.geekbang.org/column/article/13803">140 | SaaS先驱Salesforce</a></h2>
<div class="outline-text-2" id="text-orgfaee257">
<p>
Salseforce是云计算先驱，也是全球知名的CRM服务提供商。在20多年前就超前地提出了云计算和SaaS服务的概念，如&#x2026;
</p>
</div>
</div>


<div id="outline-container-org56295bf" class="outline-2">
<h2 id="org56295bf"><a href="https://time.geekbang.org/column/article/13813">141 | 太超前好不好</a></h2>
<div class="outline-text-2" id="text-org56295bf">
<p>
在计算机和互联网的发展过程中，你经常可以看到某些公司的想法和理念很超前。有些超前的公司死掉了，有些超前的&#x2026;
</p>
</div>
</div>


<div id="outline-container-org315ac9c" class="outline-2">
<h2 id="org315ac9c"><a href="https://time.geekbang.org/column/article/14346">142 | Sun：太阳的升起</a></h2>
<div class="outline-text-2" id="text-org315ac9c">
<p>
Sun是一个在计算机发展史上有着重要历史地位的公司，2009年被Oracle收购。Sun的发展经历过升起和壮大，又经历过&#x2026;
</p>
</div>
</div>


<div id="outline-container-org54a2e23" class="outline-2">
<h2 id="org54a2e23"><a href="https://time.geekbang.org/column/article/14347">143 | Sun：太阳的陨落</a></h2>
<div class="outline-text-2" id="text-org54a2e23">
<p>
上回我说到Sun公司是怎么样从成立到快速发展，一步一步走向巅峰的。可惜Sun的巅峰没有维持多久，伴随.com的泡&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgc075856" class="outline-2">
<h2 id="orgc075856"><a href="https://time.geekbang.org/column/article/14348">144 | 看错敌人多可怕</a></h2>
<div class="outline-text-2" id="text-orgc075856">
<p>
Sun公司攫取小型机市场的时候，个人计算机也在攫取它的市场。可是Sun却从来没把个人计算机这个真正的敌人当回事&#x2026;
</p>
</div>
</div>


<div id="outline-container-org6b9ae54" class="outline-2">
<h2 id="org6b9ae54"><a href="https://time.geekbang.org/column/article/16617">145 | SAP的HANA战略（上）</a></h2>
<div class="outline-text-2" id="text-org6b9ae54">
<p>
2009年全球知名ERP公司SAP开始了一场声势浩大的战略转型。这场以HANA这个内存数据库为核心的转型波澜壮阔，集技&#x2026;
</p>
</div>
</div>


<div id="outline-container-org5425be4" class="outline-2">
<h2 id="org5425be4"><a href="https://time.geekbang.org/column/article/16625">146 | SAP的HANA战略（下）</a></h2>
<div class="outline-text-2" id="text-org5425be4">
<p>
今天，我们一起来看看忽悠以后SAP是怎样通过几年的时间成功实施了战略转型的。SAP的HANA转型概括起来就是四个字&#x2026;
</p>
</div>
</div>


<div id="outline-container-org2e7ee34" class="outline-2">
<h2 id="org2e7ee34"><a href="https://time.geekbang.org/column/article/16640">147 | 成功的忽悠加成功的执行等于成功的产品</a></h2>
<div class="outline-text-2" id="text-org2e7ee34">
<p>
SAP HANA的战略转型可谓精彩绝伦。我们能从中学到什么呢？成功的忽悠加成功的执行等于成功的产品。两者缺一不&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgc0ed8c1" class="outline-2">
<h2 id="orgc0ed8c1"><a href="https://time.geekbang.org/column/article/16656">148 | SQL Server发展史</a></h2>
<div class="outline-text-2" id="text-orgc0ed8c1">
<p>
坊间传闻，微软从Sybase买了一份源代码，从此有了SQL Server。Sybase因此而被收购了，微软却蒸蒸日上。
</p>
</div>
</div>


<div id="outline-container-org2a87d51" class="outline-2">
<h2 id="org2a87d51"><a href="https://time.geekbang.org/column/article/16665">149 | 眼光决定一切</a></h2>
<div class="outline-text-2" id="text-org2a87d51">
<p>
做产品的很多时候，眼光是很重要的。眼光决定了努力的方向。方向对了，努力才能成功；方向错了，即便再努力也白&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgf6b47aa" class="outline-2">
<h2 id="orgf6b47aa"><a href="https://time.geekbang.org/column/article/16682">150 | Ashton-Tate：桌面数据库王者的兴衰</a></h2>
<div class="outline-text-2" id="text-orgf6b47aa">
<p>
dBase这款产品现在对我们来说已经很陌生了，但是它曾经是一款非常著名的桌面数据库产品。它由已经不存在的Ashto&#x2026;
</p>
</div>
</div>


<div id="outline-container-org4d8c0b1" class="outline-2">
<h2 id="org4d8c0b1"><a href="https://time.geekbang.org/column/article/16691">151 | 无敌不可以肆意妄为</a></h2>
<div class="outline-text-2" id="text-org4d8c0b1">
<p>
亚马逊领导力准则教导我们要客户至尚。但是我们经常看到有些企业做大了以后就不把客户当回事，肆意妄为了。这些&#x2026;
</p>
</div>
</div>


<div id="outline-container-org829fe4d" class="outline-2">
<h2 id="org829fe4d"><a href="https://time.geekbang.org/column/article/16700">152 | Reddit：天涯论坛美国版</a></h2>
<div class="outline-text-2" id="text-org829fe4d">
<p>
Reddit是美国非常著名的一个论坛，按照访问量来说，它也是美国第四大网站，全球第八大。Reddit同时是一个看起来&#x2026;
</p>
</div>
</div>
