src/geekbang-tech-and-business-cases.org
** [[https://time.geekbang.org/column/article/16722][153 | Hacker News：创业社交两不误]]

Hacker News是作为Arc语言的一个样板产品出现的，但Hacker News本身却很快吸引了投资人和创业者，并逐渐成为...


** [[https://time.geekbang.org/column/article/40503][154 | Y Combinator：孵化器还是培训班？]]

Y Combinator是由Paul Graham创立的著名孵化器，成功孵化出了Dropbox、Airbnb等很多著名的独角兽。


** [[https://time.geekbang.org/column/article/40535][155 | 创业公司进孵化器真的值得吗？]]

伴随Y Combinator孵化器在全球范围内的成功，越来越多的创业公司都要面临着一个选择：到底应不应该进孵化器？


** [[https://time.geekbang.org/column/article/40536][156 | Paul Graham：硅谷创业教父]]

创业是很多人都想做的事情，但是创业也很危险。如果有一位经验丰富的人指导你，创业机会大增的话，你是不是愿意...


** [[https://time.geekbang.org/column/article/40537][157 | Zynga：发家从农场开始]]

Zynga曾是网络游戏市场上一家著名的公司。它在当年PC机社交时代占据了重要的地位，但是Zynga自从上市以后就开...


** [[https://time.geekbang.org/column/article/40538][158 | 论Zynga的倒台]]

Zynga兴起以后就开始慢慢的走向下坡路了。那么Zynga是怎么倒台的呢，我们来看看。


** [[https://time.geekbang.org/column/article/40539][159 | 企业分析要求综合素质]]

本文作为专栏的最后一篇，总结一下我对企业分析的看法。企业分析需要综合素质，这是我这一年来对企业分析的理解...


** [[https://time.geekbang.org/column/article/40936][结束语 | 积跬步，而终至千里]]

陪君一年，终有一别。希望我的专栏故事，让每一个“你”都有一份不同的收获。


** [[https://time.geekbang.org/column/article/40949][一键直达 | 系列解读文章回顾]]

这些系列文章虽有序却分散在全年的专栏目录中，专栏的最后，我们整理了几大系列文章的直达目录，以方便你按行业...

